espressif/esp-idf/components/esp_common/test_apps/esp_common/sdkconfig.ci.xip_psram_esp32s2
# For XiP PSRAM EXT_RAM_BSS_ATTR

CONFIG_IDF_TARGET="esp32s2"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
